Revit 2024 API
MEPAnalyticalSegment Class
 Represents an analytical segment of the MEP analytical model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class MEPAnalyticalSegment : IDisposable
Visual Basic
Public Class MEPAnalyticalSegment _
	Implements IDisposable
Visual C++
public ref class MEPAnalyticalSegment : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment
See Also
MEPAnalyticalSegment Members
Autodesk.Revit.DB.Analysis Namespace